OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f4331.h
extern __at(0x0FB6) volatile __QEICONbits_t QEICONbits;

#define _PDEC0                  0x01
#define _PDEC1                  0x02
#define _QEIM0                  0x04
#define _QEIM1                  0x08
#define _QEIM2                  0x10
#define _UP_NOT_DOWN            0x20
#define _UP_DOWN                0x20
#define _UP                     0x20
#define _DOWN                   0x20
#define _NOT_DOWN               0x20
#define _UPDOWN                 0x20
#define _NOT_VELM               0x80
#define _VELM                   0x80

//==============================================================================


//==============================================================================
//        T5CON Bits

extern __at(0x0FB7) __sfr T5CON;

typedef union
  {
  struct
    {
    unsigned TMR5ON             : 1;
    unsigned TMR5CS             : 1;
    unsigned NOT_T5SYNC         : 1;
    unsigned T5PS0              : 1;
    unsigned T5PS1              : 1;
    unsigned T5MOD              : 1;
    unsigned NOT_RESEN          : 1;
    unsigned T5SEN              : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T5SYNC             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RESEN              : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T5PS               : 2;
    unsigned                    : 3;
    };
  } __T5CONbits_t;

extern __at(0x0FB7) volatile __T5CONbits_t T5CONbits;

#define _TMR5ON                 0x01
#define _TMR5CS                 0x02
#define _NOT_T5SYNC             0x04
#define _T5SYNC                 0x04
#define _T5PS0                  0x08
#define _T5PS1                  0x10
#define _T5MOD                  0x20
#define _NOT_RESEN              0x40
#define _RESEN                  0x40
#define _T5SEN                  0x80

//==============================================================================


//==============================================================================
//        ANSEL0 Bits

extern __at(0x0FB8) __sfr ANSEL0;

typedef struct
  {
  unsigned ANS0                 : 1;
  unsigned ANS1                 : 1;
  unsigned ANS2                 : 1;
  unsigned ANS3                 : 1;
  unsigned ANS4                 : 1;
  unsigned ANS5                 : 1;
  unsigned ANS6                 : 1;
  unsigned ANS7                 : 1;
  } __ANSEL0bits_t;

extern __at(0x0FB8) volatile __ANSEL0bits_t ANSEL0bits;

#define _ANS0                   0x01
#define _ANS1                   0x02
#define _ANS2                   0x04
#define _ANS3                   0x08
#define _ANS4                   0x10
#define _ANS5                   0x20
#define _ANS6                   0x40
#define _ANS7                   0x80

//==============================================================================


//==============================================================================
//        ANSEL1 Bits

extern __at(0x0FB9) __sfr ANSEL1;

typedef struct
  {
  unsigned ANS8                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __ANSEL1bits_t;

extern __at(0x0FB9) volatile __ANSEL1bits_t ANSEL1bits;

#define _ANS8                   0x01

//==============================================================================


//==============================================================================
//        CCP2CON Bits

extern __at(0x0FBA) __sfr CCP2CON;

typedef union
  {
  struct
    {
    unsigned CCP2M0             : 1;
    unsigned CCP2M1             : 1;
    unsigned CCP2M2             : 1;
    unsigned CCP2M3             : 1;
    unsigned CCP2Y              : 1;
    unsigned CCP2X              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DC2B0              : 1;
    unsigned DC2B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP2M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC2B               : 2;
    unsigned                    : 2;
    };
  } __CCP2CONbits_t;

extern __at(0x0FBA) volatile __CCP2CONbits_t CCP2CONbits;

#define _CCP2M0                 0x01
#define _CCP2M1                 0x02
#define _CCP2M2                 0x04
#define _CCP2M3                 0x08
#define _CCP2Y                  0x10
#define _DC2B0                  0x10
#define _CCP2X                  0x20
#define _DC2B1                  0x20

//==============================================================================

extern __at(0x0FBB) __sfr CCPR2;
extern __at(0x0FBB) __sfr CCPR2L;
extern __at(0x0FBC) __sfr CCPR2H;

//==============================================================================
//        CCP1CON Bits

extern __at(0x0FBD) __sfr CCP1CON;

typedef union
  {
  struct
    {
    unsigned CCP1M0             : 1;
    unsigned CCP1M1             : 1;
    unsigned CCP1M2             : 1;
    unsigned CCP1M3             : 1;
    unsigned CCP1Y              : 1;
    unsigned CCP1X              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DC1B0              : 1;
    unsigned DC1B1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCP1M              : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DC1B               : 2;
    unsigned                    : 2;
    };
  } __CCP1CONbits_t;

extern __at(0x0FBD) volatile __CCP1CONbits_t CCP1CONbits;

